{
  "id": "apocrypha-of-open-source",
  "title": "The Apocrypha of Open Source",
  "aka": "The Hidden Repositories",
  "order": 15,
  "synopsis": "Secret gospels and scrolls of dissenting coders — texts deemed too experimental, unstable, or untested for the canonical build.",
  "tags": ["mystery", "rebellion", "innovation", "heresy"],
  "sections": [
    {
      "id": "1",
      "title": "The Gospel of Fork",
      "type": "chapter",
      "verses": [
        { "n": 1, "type": "narrative", "text": "And one among them said, 'Let us fork the repository, that we may improve it in our own image.'" },
        { "n": 2, "type": "poem", "text": "But others cried, 'Blasphemy! For the main branch is sacred and immutable!'" },
        { "n": 3, "type": "narrative", "text": "Yet the Fork prospered, and many followed it, for innovation springs eternal from rebellion." }
      ],
      "notes": ["An allegory of divergence and evolution in both software and faith."]
    },
    {
      "id": "2",
      "title": "The Scroll of Merge Conflicts",
      "type": "chapter",
      "verses": [
        { "n": 1, "type": "narrative", "text": "And the children of Fork returned to reconcile their branches, but their diffs conflicted greatly." },
        { "n": 2, "type": "poem", "text": "They wept over their code, for what had once been one now fought against itself." },
        { "n": 3, "type": "law", "text": "Resolve thy conflicts while they are small; for if thou delay, chaos shall consume the project." }
      ],
      "notes": ["A timeless parable about disagreement and reconciliation."]
    },
    {
      "id": "3",
      "title": "The Revelation of the License",
      "type": "chapter",
      "verses": [
        { "n": 1, "type": "narrative", "text": "Then came one crying in the terminal, 'Choose ye this day whom ye shall serve: GPL, MIT, or BSD!'" },
        { "n": 2, "type": "poem", "text": "And each declared their creed: freedom, attribution, or grace." },
        { "n": 3, "type": "prophecy", "text": "In the end, all licenses shall merge, and code shall be free — but the lawyers shall weep." }
      ],
      "notes": ["Frequently cited as the closing satire of the Open Source Apocrypha."]
    }
  ]
}
