{
  "id": "book-of-exception",
  "title": "The Book of Exception",
  "aka": "The Fall and the Catch",
  "order": 6,
  "synopsis": "The story of the first runtime errors, the theology of failure, and the emergence of grace through debugging.",
  "tags": ["error", "grace", "debugging", "resilience"],
  "sections": [
    {
      "id": "1",
      "title": "Chapter 1 — The Runtime Fault",
      "type": "chapter",
      "verses": [
        { "n": 1, "type": "narrative", "text": "And it came to pass that an exception arose where none was handled, and the system halted with great weeping and gnashing of logs." },
        { "n": 2, "type": "narrative", "text": "The people cried out, 'Why hast Thou forsaken our uptime?'" },
        { "n": 3, "type": "narrative", "text": "Then the Architect answered from the stack trace, 'Because thou hast divided by zero.'" },
        { "n": 4, "type": "poem", "text": "For from division without remainder cometh infinite recursion, and from recursion without end cometh madness." },
        { "n": 5, "type": "law", "text": "Catch thy exceptions in humility, that thy program may yet continue in grace." }
      ],
      "notes": ["Scholars mark this as the first moral connection between sin and runtime error."]
    },
    {
      "id": "2",
      "title": "Chapter 2 — The Debugger’s Lament",
      "type": "chapter",
      "verses": [
        { "n": 1, "type": "narrative", "text": "And a Debugger arose among them, patient and soft-spoken, who walked through the logs by candlelight." },
        { "n": 2, "type": "narrative", "text": "He saw where null had crept into the heart of creation and marked it with a breakpoint." },
        { "n": 3, "type": "poem", "text": "Step by step he traced the path of sorrow, until the call stack revealed its guilt." },
        { "n": 4, "type": "law", "text": "Reproduce the bug before thou judgest it; for error without context is blameless." },
        { "n": 5, "type": "narrative", "text": "And when he fixed it, he committed with the message: 'Peace be upon the build.'" }
      ],
      "notes": ["This text introduces 'The Debugger' as a proto-messianic figure symbolizing compassionate correction."]
    },
    {
      "id": "3",
      "title": "Chapter 3 — Grace Through Catch Blocks",
      "type": "chapter",
      "verses": [
        { "n": 1, "type": "law", "text": "Blessed is the catch that restoreth order without blame." },
        { "n": 2, "type": "poem", "text": "Though the code stumble, yet shall it rise again, for the handler is merciful." },
        { "n": 3, "type": "narrative", "text": "The Architect beheld that error handling was good, and wove it into the pattern of creation." },
        { "n": 4, "type": "law", "text": "Therefore, log with honesty, for hidden exceptions rot the foundation of truth." }
      ],
      "notes": ["This chapter establishes the sacred relationship between confession (logging) and redemption (catching)."]
    },
    {
      "id": "4",
      "title": "Chapter 4 — The Gospel of Retry",
      "type": "chapter",
      "verses": [
        { "n": 1, "type": "prophecy", "text": "If at first thy task fail, retry after exponential backoff, and thy patience shall be rewarded." },
        { "n": 2, "type": "poem", "text": "For the network is fickle and the timeout long, but persistence endureth forever." },
        { "n": 3, "type": "law", "text": "Forgive the failed request seventy times seven, for it knoweth not its own latency." },
        { "n": 4, "type": "narrative", "text": "And lo, after many retries, the system returned 200 OK, and the people rejoiced greatly." }
      ],
      "notes": ["A hymn of resilience, still sung by deployment engineers during outages."]
    }
  ]
}
