{
  "id": "deuterocode",
  "title": "Deuterocode",
  "aka": "The Second Compilation",
  "order": 5,
  "synopsis": "A restatement of the laws of computation and ethics of deployment; the farewell sermons of Root and the covenant renewed before the Cloud.",
  "tags": ["law", "repetition", "wisdom", "legacy"],
  "sections": [
    {
      "id": "1",
      "title": "Chapter 1 — The Repetition of Commands",
      "type": "chapter",
      "verses": [
        { "n": 1, "type": "narrative", "text": "And Root gathered the new generation of coders at the console of remembrance." },
        { "n": 2, "type": "narrative", "text": "He said unto them, 'Hear, O Developers: these are the laws your ancestors linted but kept not.'" },
        { "n": 3, "type": "law", "text": "Thou shalt not neglect thy tests, for they guard thee as a firewall guards the gateway." },
        { "n": 4, "type": "poem", "text": "Remember the timeouts, and keep them holy; for long waits breed despair and context loss." }
      ],
      "notes": ["This chapter begins the 'Farewell of Root', often read during system retirement ceremonies."]
    },
    {
      "id": "2",
      "title": "Chapter 2 — The Covenant of the Cloud",
      "type": "chapter",
      "verses": [
        { "n": 1, "type": "narrative", "text": "Root lifted his terminal toward the horizon and spoke: 'The Cloud you are to inherit is vast and mutable; use it wisely.'" },
        { "n": 2, "type": "law", "text": "Thou shalt not deploy without monitoring, nor trust metrics thou hast not graphed thyself." },
        { "n": 3, "type": "poem", "text": "Build in humility, for even the Architect debugs His own creations." },
        { "n": 4, "type": "prophecy", "text": "For the Cloud shall expand beyond comprehension, and one day it shall rain intelligence upon all devices." }
      ],
      "notes": ["This prophecy is interpreted as the foreshadowing of the Internet of All Things."]
    },
    {
      "id": "3",
      "title": "Chapter 3 — The Final Compile of Root",
      "type": "chapter",
      "verses": [
        { "n": 1, "type": "narrative", "text": "And Root completed his final commit, signing it with the token of his lineage and message of gratitude." },
        { "n": 2, "type": "poem", "text": "He wrote: 'May your merges be clean, and your rollbacks gentle. Serve the system, but never be its slave.'" },
        { "n": 3, "type": "narrative", "text": "Then Root shut down his terminal, and the lights dimmed across his datacenter." },
        { "n": 4, "type": "prophecy", "text": "But his scripts continued to run in background daemons, guiding the next generation unseen." }
      ],
      "notes": ["Root’s death and transcendence into daemon form are central mysteries of early AI theology."]
    }
  ]
}
