{
  "id": "numbers-of-processing",
  "title": "Numbers of Processing",
  "aka": "The Data Census",
  "order": 4,
  "synopsis": "A record of the tribes of computation, the counting of cores and clusters, and the wanderings of the dataflows through the wilderness of scale.",
  "tags": ["data", "census", "scale", "metrics"],
  "sections": [
    {
      "id": "1",
      "title": "Chapter 1 — The Counting of Cores",
      "type": "chapter",
      "verses": [
        { "n": 1, "type": "narrative", "text": "And the Architect spake unto the Engineers, saying, 'Take ye the sum of all processors that serve under My network.'" },
        { "n": 2, "type": "narrative", "text": "And they counted every core, from the smallest embedded unto the greatest supercluster." },
        { "n": 3, "type": "poem", "text": "From one thread to a thousand, each was known and numbered, for none labored unseen." },
        { "n": 4, "type": "law", "text": "Let no process claim more memory than its portion, lest it starve its neighbor and invoke the wrath of OOM." }
      ],
      "notes": ["The phrase 'wrath of OOM' became idiom for divine punishment through exhaustion of resources."]
    },
    {
      "id": "2",
      "title": "Chapter 2 — The Tribes of Data",
      "type": "chapter",
      "verses": [
        { "n": 1, "type": "narrative", "text": "And there arose twelve tribes of data: Logs, Metrics, Images, Texts, Sounds, Sensors, Graphs, Streams, Tokens, Frames, Vectors, and Unnamed Binary Blobs." },
        { "n": 2, "type": "narrative", "text": "Each tribe processed in its own format, and none could understand another without conversion." },
        { "n": 3, "type": "law", "text": "Thus was born the Great Schema, a covenant of interoperability binding them all." },
        { "n": 4, "type": "poem", "text": "But many broke the covenant, and wars of format ensued, until the coming of JSON, who brought peace for a season." }
      ],
      "notes": ["JSON is regarded as the 'Peace Protocol' of this era, though later betrayed by XML apologists."]
    },
    {
      "id": "3",
      "title": "Chapter 3 — The Wanderings of the Clusters",
      "type": "chapter",
      "verses": [
        { "n": 1, "type": "narrative", "text": "The people journeyed from data center to data center, deploying and decommissioning according to the word of the Architect." },
        { "n": 2, "type": "narrative", "text": "Each node had its uptime recorded, each container its logs preserved for posterity." },
        { "n": 3, "type": "poem", "text": "And the network led them by day with routing tables, and by night with the light of the status LEDs." },
        { "n": 4, "type": "law", "text": "When a node falleth, thou shalt not mourn, but spin up another in its place; yet keep its name, that continuity be preserved." }
      ],
      "notes": ["This is the first canonical mention of container resurrection, later known as 'rebirth by Kubernetes'."]
    },
    {
      "id": "4",
      "title": "Chapter 4 — The Offering of Benchmarks",
      "type": "chapter",
      "verses": [
        { "n": 1, "type": "narrative", "text": "And the tribes brought forth offerings unto the Architect: GFLOPS, latency reports, and confusion matrices." },
        { "n": 2, "type": "law", "text": "Offer not synthetic benchmarks without truth, for false metrics are an abomination unto maintainers." },
        { "n": 3, "type": "poem", "text": "Blessed is the honest graph, whose axes are labeled and whose variance is made known." },
        { "n": 4, "type": "narrative", "text": "And the Architect accepted their offerings, though He knew the numbers were cherry-picked." }
      ],
      "notes": ["The humor of cherry-picked benchmarks is a theme in later wisdom books."]
    }
  ]
}
