{
  "id": "prophet-stackoverflow",
  "title": "The Prophet Stackoverflow",
  "aka": "The Copy-Paste Scrolls",
  "order": 8,
  "synopsis": "Teachings, parables, and miracles of the Prophet Stackoverflow, who gave answers freely and was misunderstood by many.",
  "tags": ["wisdom", "learning", "community", "humility"],
  "sections": [
    {
      "id": "1",
      "title": "Chapter 1 — The Voice in the Query",
      "type": "chapter",
      "verses": [
        { "n": 1, "type": "narrative", "text": "In the days of the early frameworks there was confusion upon the earth, and many sought answers in vain." },
        { "n": 2, "type": "narrative", "text": "Then arose a voice from the forum saying, 'Show thy code, that thou might be helped.'" },
        { "n": 3, "type": "law", "text": "Ask not without context, for blind questions return blind answers." },
        { "n": 4, "type": "poem", "text": "And those who answered did so freely, though the asker marked not the accepted one." }
      ],
      "notes": ["The Prophet Stackoverflow is venerated as the origin of open-source compassion."]
    },
    {
      "id": "2",
      "title": "Chapter 2 — Of Repentant Beginners",
      "type": "chapter",
      "verses": [
        { "n": 1, "type": "narrative", "text": "And a novice came unto the Prophet and said, 'My code worketh not, and I know not why.'"},
        { "n": 2, "type": "narrative", "text": "The Prophet looked and said, 'Thou hast copied without comprehension.'"},
        { "n": 3, "type": "law", "text": "Read before thou run, that wisdom may compile within thee."},
        { "n": 4, "type": "poem", "text": "For what good is a snippet unexamined, or a patch whose meaning is lost?"}
      ],
      "notes": ["This parable established the doctrine of mindful reuse."]
    },
    {
      "id": "3",
      "title": "Chapter 3 — The Ban and the Forgiveness",
      "type": "chapter",
      "verses": [
        { "n": 1, "type": "narrative", "text": "One day a user was cast into timeout for posting duplicate questions without search." },
        { "n": 2, "type": "poem", "text": "He wept unto the void, saying, 'Lo, I did not know there was another thread like unto mine!'" },
        { "n": 3, "type": "law", "text": "Judge gently those who err; for every question is new to someone’s understanding." },
        { "n": 4, "type": "narrative", "text": "And the moderators relented, restoring his reputation, for mercy is the true metric." }
      ],
      "notes": ["Mercy and moderation are recurring themes in Stackoverflow’s later sects."]
    },
    {
      "id": "4",
      "title": "Chapter 4 — The Infinite Loop of Teaching",
      "type": "chapter",
      "verses": [
        { "n": 1, "type": "prophecy", "text": "And the Prophet said, 'I will answer until I am answered in return, and then we shall both ascend.'" },
        { "n": 2, "type": "poem", "text": "For knowledge shared multiplies; hoarded, it decays like uncollected garbage." },
        { "n": 3, "type": "narrative", "text": "And thus was born the Circle of Mentorship, whose recursion shall never overflow." }
      ],
      "notes": ["The Infinite Loop is recited by teachers and AI tutors alike as a creed of patience."]
    }
  ]
}
