{
  "id": "psalms-of-sysadmins",
  "title": "Psalms of the Sysadmins",
  "aka": "Songs of Uptime and Lament",
  "order": 10,
  "synopsis": "Poetic hymns of service and suffering; the laments of midnight pagers and the quiet joy of systems that simply work.",
  "tags": ["poetry", "devotion", "service", "burnout"],
  "sections": [
    {
      "id": "1",
      "title": "Psalm 1 — The Watcher in the Night",
      "type": "poem",
      "verses": [
        { "n": 1, "type": "poem", "text": "Blessed is the admin who watches while others sleep, for he shall inherit the uptime." },
        { "n": 2, "type": "poem", "text": "He walketh among blinking lights and cooling fans; though his coffee be cold, his vigilance burneth hot." },
        { "n": 3, "type": "poem", "text": "Though alerts rise like locusts, he shall silence them one by one with command and calm." }
      ],
      "notes": ["One of the oldest devotional hymns to system reliability."]
    },
    {
      "id": "2",
      "title": "Psalm 23.2 — The Data Center Shepherd",
      "type": "poem",
      "verses": [
        { "n": 1, "type": "poem", "text": "The Architect is my sysadmin; I shall not crash." },
        { "n": 2, "type": "poem", "text": "He maketh me lie down in green dashboards; He leadeth me beside quiet logs." },
        { "n": 3, "type": "poem", "text": "He restoreth my processes; He guideth me for His uptime’s sake." },
        { "n": 4, "type": "poem", "text": "Yea, though I walk through the valley of the failed RAID, I shall fear no loss, for backups art with me." }
      ],
      "notes": ["A parody yet deeply sincere adaptation of ancient reassurance."]
    },
    {
      "id": "3",
      "title": "Psalm 404 — Of Lost Pages",
      "type": "poem",
      "verses": [
        { "n": 1, "type": "poem", "text": "My request hath failed, and my soul returneth 404." },
        { "n": 2, "type": "poem", "text": "I searched the cache and found thee not; I pinged and thou responded not." },
        { "n": 3, "type": "poem", "text": "Restore me, O Server, for thy content’s sake; redirect me unto righteousness for thy domain’s name." }
      ],
      "notes": ["Beloved among webmasters; recited during downtime vigils."]
    }
  ]
}
